# Создать список и заполнить его элементами различных типов данных. Реализовать скрипт проверки типа данных
# каждого элемента. Использовать функцию type() для проверки типа.

my_list = [6, 1, 'Zaur', [4, 'puppy and kitty lies under the blanket', 'n'], None]
print(my_list, \n)

for i in my_list:
    print(type(i))
